rjsachse/ESP32-OnvifServer/onvif_service.cpp
#include "ESP32-OnvifServer.h"
//#include "lwip/apps/sntp.h" // Include SNTP header
#include "esp_sntp.h"
#include "service_headers.h"
#include "discovery_service.h"
#include "device_service.h"
#include "media_service.h"
#include "events_service.h"
#include "imaging_service.h"
#include "ptz_service.h"

//#include <vector>

std::vector<ONVIFServer::Resolution> ONVIFServer::getCameraResolutions(camera_pid_t pid) {
  switch (pid) {
    case OV9650_PID:
    case OV3660_PID:
    case OV2640_PID:
    case OV7670_PID:
    case NT99141_PID:
    case GC2145_PID:
    case GC032A_PID:
    case GC0308_PID:
    case BF3005_PID:
    case BF20A6_PID:
    case SC101IOT_PID:
    case SC030IOT_PID:
    case SC031GS_PID:
      return {
        {2592, 1944}, {1600, 1200}, {1280, 1024}, {1280, 720}, 
        {1024, 768}, {800, 600}, {640, 480}, {320, 240}, 
        {240, 240}, {320, 320}, {400, 296}, {480, 320}, 
        {176, 144}, {160, 120}, {128, 128}, {96, 96}
      };
    case OV5640_PID:
    case MEGA_CCM_PID:
      return {
        {2592, 1944}, {2560, 1920}, {2560, 1600}, {2560, 1440}, 
        {2048, 1536}, {1920, 1080}, {1600, 1200}, {1280, 1024}, 
        {1280, 720}, {1024, 768}, {800, 600}, {720, 1280}, 
        {640, 480}, {480, 320}, {320, 240}, {240, 240}, 
        {320, 320}, {400, 296}, {176, 144}, {160, 120}, 
        {128, 128}, {96, 96}
      };
    case OV7725_PID:
      return {
        {640, 480}, {320, 240}, {240, 240}, {320, 320}, 
        {400, 296}, {480, 320}, {176, 144}, {160, 120}, 
        {128, 128}, {96, 96}
      };
    default:
      return {};
  }
}

const char* ONVIFServer::getResolutions() {
  sensor_t *s = esp_camera_sensor_get();
  if (!s) {
    LOG_ERR("Camera sensor not detected");
    return nullptr;
  }
  std::vector<Resolution> resolutions = getCameraResolutions(static_cast<camera_pid_t>(s->id.PID));

  static char resolutionsXml[2560] = "";
  char resolutionEntry[110];

  resolutionsXml[0] = '\0'; // Clear the string

  for (const auto& res : resolutions) {
    snprintf(resolutionEntry, sizeof(resolutionEntry), 
      "<tt:ResolutionsAvailable>"
      "<tt:Width>%d</tt:Width>"
      "<tt:Height>%d</tt:Height>"
      "</tt:ResolutionsAvailable>", 
      res.width, res.height);
    strncat(resolutionsXml, resolutionEntry, sizeof(resolutionsXml) - strlen(resolutionsXml) - 1);
  }
  return resolutionsXml;
}

void ONVIFServer::extractMessageID(const char* packetData, char* messageID, size_t messageIDSize) {
  const char* startTag = "MessageID";
  const char* startPtr = strstr(packetData, startTag);
  if (!startPtr) {
    LOG_ERR("MessageID tag not found");
    messageID[0] = '\0';
    return;
  }
  startPtr = strchr(startPtr, '>') + 1;
  while (*startPtr == ' ' || *startPtr == '\n' || *startPtr == '\r') {
    startPtr++;
  }
  const char* endPtr = strstr(startPtr, "</");
  if (!endPtr) {
    LOG_ERR("MessageID end tag not found");
    messageID[0] = '\0';
    return;
  }

  // Check for prefixes and remove them from startPtr
  const char urnPrefix[] = "urn:";
  const char uuidPrefix[] = "uuid:";
  
  if (strncmp(startPtr, urnPrefix, strlen(urnPrefix)) == 0) {
    startPtr += strlen(urnPrefix);
  }
  
  if (strncmp(startPtr, uuidPrefix, strlen(uuidPrefix)) == 0) {
    startPtr += strlen(uuidPrefix);
  }
  
  size_t len = endPtr - startPtr;
  if (len >= messageIDSize) {
    LOG_ERR("MessageID is too long: %.*s", (int)len, startPtr);
    messageID[0] = '\0';
    return;
  }
  
  // Copy the cleaned message ID into the buffer
  strncpy(messageID, startPtr, len);
  messageID[len] = '\0';
}



void ONVIFServer::generateUUID(char* uuid, size_t uuidSize) {
  snprintf(uuid, uuidSize, "%08lx-%04lx-%04lx-%04lx-%012llx",
           (unsigned long)esp_random(), esp_random() & 0xFFFF,
           (esp_random() & 0x0FFF) | 0x4000,
           (esp_random() & 0x3FFF) | 0x8000,
           ((unsigned long long)esp_random() << 32) | esp_random());
}

void ONVIFServer::generateDeviceUUID(char* uuid, size_t uuidSize) {
  uint32_t chipId = ESP.getEfuseMac(); // Get the chip ID
  snprintf(uuid, uuidSize, "%08lx-%04lx-%04lx-%04lx-%012lx",
           (unsigned long)((chipId >> 16) & 0xFFFF),
           (unsigned long)(chipId & 0xFFFF),
           (unsigned long)((chipId >> 16) & 0xFFFF),
           (unsigned long)(chipId & 0xFFFF),
           (unsigned long)(chipId));
}

char* ONVIFServer::getAction(const char* requestBody) {
  char* action = NULL;
  char* body_start = strstr((char*)requestBody, ":Body");
  if (body_start) {
    // Move to end of <*:Body ...>
    body_start = strchr(body_start, '>');
    if (body_start) {
      body_start++; // Move past '>'
      char* action_start = strstr(body_start, "<");
      if (action_start) {
        action_start++;
        char* action_end = strchr(action_start, ' ');
        if (!action_end) {
          action_end = strchr(action_start, '>');
        }
        if (action_end) {
          size_t action_len = action_end - action_start;
          action = (char*)malloc(action_len + 1);
          if (action) {
            strncpy(action, action_start, action_len);
            action[action_len] = '\0';
          }
        }
      }
    }
  }
  return action;
}

void ONVIFServer::populateOnvifResponse(const char* mainHeader, const char* templateStr, ...) {
  if (onvifBuffer == NULL) {
    LOG_ERR("ONVIF Buffer not allocated! Unable to create response, starting Onvif.");
    return;
  }

  snprintf((char*)onvifBuffer, ONVIF_BUFFER_SIZE, "%s", mainHeader);
  va_list args;
  va_start(args, templateStr);
  vsnprintf((char*)onvifBuffer + strlen((char*)onvifBuffer), ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer), templateStr, args);
  va_end(args);

  strncat((char*)onvifBuffer, footer, ONVIF_BUFFER_SIZE - strlen((char*)onvifBuffer) - 1);
}

char* ONVIFServer::populateSection(const char* format, ...) {
  char* buffer = (char*)malloc(ONVIF_PARTS_BUFFER_SIZE);
  if (!buffer) {
    LOG_ERR("Failed to allocate memory for section buffer");
    return NULL;
  }
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, ONVIF_PARTS_BUFFER_SIZE, format, args);
  va_end(args);
  allocatedBuffers.push_back(buffer); // Add buffer to the list
  return buffer;
}


