rjsachse/ESP32-OnvifServer/onvif_service.cpp
  time_t t = mktime(&timeinfo);
  struct timeval now = { .tv_sec = t };
  settimeofday(&now, NULL);

  // Set the timezone
  setenv("TZ", timeZone, 1);
  tzset();

  LOG_INF("System date and time set to: %04d-%02d-%02d %02d:%02d:%02d, TimeZone: %s, DaylightSavings: %s",
          year, month, day, hour, minute, second, timeZone, daylightSavings);
}

void ONVIFServer::parseNetworkProtocols(const char* requestBody) {
  char protocolName[16], enabledStr[6];
  int port;

  const char* protocols[] = {"HTTP", "HTTPS", "RTSP"};

  for (const char* protocol : protocols) {
    // Extract and log Protocol Name
    if (!extractStringValue(requestBody, protocol, protocolName, sizeof(protocolName))) {
      LOG_ERR("Failed to extract Protocol Name for %s", protocol);
      return;
    }
    LOG_INF("Extracted Protocol Name: %s", protocolName);

    // Extract and log Enabled status
    if (!extractStringValue(requestBody, "Enabled", enabledStr, sizeof(enabledStr))) {
      LOG_ERR("Failed to extract Enabled status for %s", protocol);
      return;
    }
    LOG_INF("Extracted Enabled status for %s: %s", protocol, enabledStr);

    // Extract and log Port
    if (!extractValue(requestBody, "Port", port)) {
      LOG_ERR("Failed to extract Port for %s", protocol);
      return;
    }
    LOG_INF("Extracted Port for %s: %d", protocol, port);

    // Apply the extracted settings
    bool enabled = strcmp(enabledStr, "true") == 0;
    setNetworkProtocol(protocolName, enabled, port);
  }
}

void ONVIFServer::setNetworkProtocol(const char* protocolName, bool enabled, int port) {
  // Set the protocol settings on the ESP32
  LOG_INF("Setting Protocol: %s, Enabled: %s, Port: %d", protocolName, enabled ? "true" : "false", port);
  
  // Implement protocol-specific logic here
  // For example, setting the HTTP server port, enabling/disabling HTTPS, etc.
}

void ONVIFServer::parseAndApplySettings(const char* requestBody) {
  LOG_INF("Received request body: %s", requestBody);

  sensor_t* s = esp_camera_sensor_get();
  if (!s) {
    LOG_ERR("Failed to get camera sensor");
    return;
  }

  int value;
  if (extractValue(requestBody, "Brightness", value)) s->set_brightness(s, value);
  if (extractValue(requestBody, "Contrast", value)) s->set_contrast(s, value);
  if (extractValue(requestBody, "ColorSaturation", value)) s->set_saturation(s, value);
  if (extractValue(requestBody, "Sharpness", value)) s->set_sharpness(s, value);

  // Exposure settings
  if (strstr(requestBody, "Exposure")) {
    if (strstr(requestBody, "Mode>AUTO")) s->set_exposure_ctrl(s, 1);
    else if (strstr(requestBody, "Mode>MANUAL")) s->set_exposure_ctrl(s, 0);

    if (extractValue(requestBody, "Gain", value)) s->set_agc_gain(s, value);
    if (extractValue(requestBody, "ExposureTime", value)) s->set_aec_value(s, value);
  }

  // White Balance settings
  if (strstr(requestBody, "WhiteBalance")) {
    if (strstr(requestBody, "Mode>AUTO")) s->set_whitebal(s, 1);
    else if (strstr(requestBody, "Mode>MANUAL")) s->set_whitebal(s, 0);
  }
}


void ONVIFServer::handleDeviceService(const char* action, const char* requestBody) {
  if (strstr(action, "GetDeviceInformation")) {
    buildOnvifResponse(maxHeader, populateSection(getDeviceInfo, manufacturer, model, version, serial, hardware));
  } else if (strstr(action, "GetCapabilities")) {
    buildOnvifResponse(maxHeader, getCapabilitiesStart,
      populateSection(getCapabilitiesDevice, ipAddress),
      enableEvents ? populateSection(getCapabilitiesEvents, ipAddress) : NULL,
      populateSection(getCapabilitiesImaging, ipAddress),
      populateSection(getCapabilitiesMedia, ipAddress),
      populateSection(getCapabilitiesExension, ipAddress, enableAudio ? "1" : "0", enableTwoWayAudio ? "1" : "0"),
      enablePTZ ? populateSection(getCapabilitiesPTZ, ipAddress) : NULL,
      getCapabilitiesEnd
    );
  } else if (strstr(action, "GetServices")) {
    buildOnvifResponse(maxHeader, getServicesStart,
      populateSection(getServicesDevice, ipAddress),
      enableEvents ? populateSection(getServicesEvent, ipAddress) : NULL,
      enableTwoWayAudio ? populateSection(getServicesMedia2, ipAddress) : NULL,
      populateSection(getServicesMedia, ipAddress),
      enablePTZ ? populateSection(getServicesPTZ, ipAddress) : NULL,
      populateSection(getServicesImage, ipAddress),
      getServicesEnd
    );
  } else if (strstr(action, "GetScopes")) {
    buildOnvifResponse(maxHeader, getScopesStart,
      enableAudio ? getScopesAudio : NULL,
      getScopesVideo,
      enablePTZ ? getScopesPTZ : NULL,
      getScopesProS,
      enableTwoWayAudio ? getScopesProT : NULL,
      populateSection(getScopesInfo, location, name, hardware),
      getScopesEnd
    );
  } else if (strstr(action, "GetZeroConfiguration")) {
    buildOnvifResponse(maxHeader, populateSection(getZeroConfig, ipAddress));
  } else if (strstr(action, "GetNetworkInterfaces")) {
    char macAddress[18];
    snprintf(macAddress, sizeof(macAddress), "%s", WiFi.macAddress().c_str());
    buildOnvifResponse(maxHeader, populateSection(getNetworkInterfaces, macAddress, ipAddress));
  } else if (strstr(action, "GetNTP")) {
    buildOnvifResponse(maxHeader, populateSection(getNTP));
  } else if (strstr(action, "GetHostname")) {
    buildOnvifResponse(maxHeader, populateSection(getHostname));
  } else if (strstr(action, "GetNetworkDefaultGateway")) {
    buildOnvifResponse(maxHeader, populateSection(getNetworkDefaultGateway));
  } else if (strstr(action, "GetNetworkProtocols")) {
    buildOnvifResponse(maxHeader, populateSection(getNetworkProtocols));
  } else if (strstr(action, "GetDiscoveryMode")) {
    buildOnvifResponse(maxHeader, populateSection(getDiscoveryMode));
  } else if (strstr(action, "GetDNS")) {
    char gatewayIP[16];
    snprintf(gatewayIP, sizeof(gatewayIP), "%u.%u.%u.%u", 
             WiFi.gatewayIP()[0], WiFi.gatewayIP()[1], 
             WiFi.gatewayIP()[2], WiFi.gatewayIP()[3]);
    buildOnvifResponse(maxHeader, populateSection(getDNS, gatewayIP));
  } else if (strstr(action, "GetSystemDateAndTime")) {
    time_t now;
    struct tm timeinfo;
    time(&now);
    gmtime_r(&now, &timeinfo); // Use gmtime_r for UTC time

